<?php
// Принято: 2, 5, 8
// Не принято: 1, 3, 4, 6, 7
?>

// простой вариант 1 задачи
// Простой вариант принят

<? /*php
$name="Константин";
$age=24;
echo<<<LINER
<p>Меня зовут$name</p><br />
<p>Мне $age года</p><br />
LINER;
echo ' " “!|\/’”\"';


*/ ?>

<?php
// Принято

function CreateImg($all = 80, $draw = 40, $pen = 23)
{
    return $all - ($draw + $pen);
}

$rezalt = CreateImg();


?>
<h1><?php echo $rezalt ?></h1>
// End task 1.2


//====================================================================================
// Bigin task 1.3

<?php
// ВЫполнено не полностью   Не понял чего не хватает

define("DB_NAME", "host");

if (DB_NAME) {
    echo DB_NAME;
} else {
    echo "Вы пытаетесь обратиться к несуществующей Константе";
    return false;
}
echo  EXIT;
?>
// End task 1.3
//====================================================================================
// Bigin task 1.4
<?php
$age=null;
// Не принято.
// Есть одно значение, которое выдаст неожиданный результат.
 $age =mt_rand(1, 110);
// Условия принято писать по-человечески. Машине все равно, в какой порядке записано неравенство,
// но человеку читать намного удобнее в порядке "Больше 18 и меньше 65"
if ($age <= 65 && $age >= 18) {
    echo "Еще работать и работать";
    // исправил, но возраст же не может быть 0.5
} elseif ($age >= 1 && $age <= 17) {
    echo "Еще рано работать";
} else {
    echo "уже можно и не работать";
}


?>
// End task 1.4
//====================================================================================
// Bigin task 1.5
<?php
// Принято
$day = mt_rand(0, 30);
switch ($day) {
    case $day > 0 && $day <= 5:
        echo "Это рабочий день";
        break;
    case $day >= 6 && $day <= 7:
        echo "Это Выходной день";
        break;
    default:
        echo "Это Неизвестный  день";
}


?>

// End task 1.5
//====================================================================================
// Bigin task 1.6
@QU Пробывал выводить с 2х вложеных foreach , что кажется лоичным но не срабатывает - почему и так и так выводит первый массив только?

<?php
// Не принято. Не соответствует задаче
$bmw = [
    "model" => "X5",
    "speed" => 120,
    "doors" => 5,
    "year" => 2015
];

$tayota = [
    "model" => "Camry",
    "speed" => 220,
    "doors" => 5,
    "year" => 2016
];
$opel = [
    "model" => "Santara",
    "speed" => 100,
    "doors" => 3,
    "year" => 2013
];

$auto = ["opel"=>$opel, "tayota"=>$tayota, "bmw"=>$bmw];

// В $value всегда массив
foreach ($auto as $mark => $value) {
    foreach ($value as $key=>$item){
        echo <<<FORMAT
<dl>
<dt>$mark</dt>
<dd>$item</dd>
</dl>
FORMAT;


    }

}
?>

// End task 1.6
//====================================================================================
// Bigin task 1.7
@QU Не пойму  как при таком выводе заставить показываться именно результат в скобках
<?php
// Внимательно перечитай задание.
// Суть: значение индекса строки и столбца чётный

echo "<table><tr>";
for ($i = 1; $i <= 10; $i++) {
    for ($j = 1; $j <= 10; $j++) {
        if (($i % 2) == 0) {
            echo
"<td>(($i*$j))</td>";


        } elseif (($i % 2) !== 0) {
            echo
"<td>[($i*$j)]</td>";


        } else {
            echo "
<td>($i*$j)</td>";


        }

    }
    if ($i != 10) {
        echo "<tr></tr>";
    }


}

echo "</tr></table>";


?>

// End task 1.7
//====================================================================================
// Bigin task 1.8
<?php
// Принято

$str = "Привет МИР PHP";
$toArr = explode(":", $str);
$i=0;
while ($i<count($toArr)){
    echo $toArr[$i]."/n";
    $i++;
}
$inArr = implode("?", $toArr);
echo $inArr;

echo $str;
?>

// End task 1.8
